Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK1024GPE064.atdf
         <module id="02141" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph_pb2_std" name="TMR1" name-in-module="TMR1" offset="0x1f820000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02815" name="TMR" version="">
                  <instance name="TMR2">
               <register-group address-space="periph_pb2_std" name="TMR2" name-in-module="TMR2" offset="0x1f820200" />
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
            <instance name="TMR3"/>
            <instance name="TMR4"/>
            <instance name="TMR5"/>
            <instance name="TMR6"/>
            <instance name="TMR7"/>
            <instance name="TMR8"/>
            <instance name="TMR9"/>
         </module>
         <module id="02478" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph_pb2_std" name="UART" name-in-module="UART" offset="0x1f828000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="UART2"/>
            <instance name="UART3"/>
            <instance name="UART4"/>
            <instance name="UART5"/>
            <instance name="UART6"/>
         </module>
         <module id="02813" name="USB" version="">
            <instance name="USB">
               <register-group address-space="periph_pb5_std" name="USB" name-in-module="USB" offset="0x1f889040" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02674" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph_pb1_std" name="WDT" name-in-module="WDT" offset="0x1f800c00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
      </peripherals>
      <interrupts>
         <interrupt caption="Core Timer Interrupt" index="0" module-instance="CORE_TIMER" name="CORE_TIMER" />
         <interrupt caption="Core Software Interrupt 0" index="1" module-instance="CORE_SOFTWARE_0" name="CORE_SOFTWARE_0" />
         <interrupt caption="Core Software Interrupt 1" index="2" module-instance="CORE_SOFTWARE_1" name="CORE_SOFTWARE_1" />
         <interrupt caption="External Interrupt 0" index="3" module-instance="EXTERNAL_0" name="EXTERNAL_0" />
         <interrupt caption="Timer1" index="4" module-instance="TIMER_1" name="TIMER_1" />
         <interrupt caption="Input Capture 1 Error" index="5" module-instance="INPUT_CAPTURE_1_ERROR" name="INPUT_CAPTURE_1_ERROR" />
         <interrupt caption="Input Capture 1" index="6" module-instance="INPUT_CAPTURE_1" name="INPUT_CAPTURE_1" />
         <interrupt caption="Output Compare 1" index="7" module-instance="OUTPUT_COMPARE_1" name="OUTPUT_COMPARE_1" />
         <interrupt caption="External Interrupt 1" index="8" module-instance="EXTERNAL_1" name="EXTERNAL_1" />
         <interrupt caption="Timer2" index="9" module-instance="TIMER_2" name="TIMER_2" />
         <interrupt caption="Input Capture 2 Error" index="10" module-instance="INPUT_CAPTURE_2_ERROR" name="INPUT_CAPTURE_2_ERROR" />
         <interrupt caption="Input Capture 2" index="11" module-instance="INPUT_CAPTURE_2" name="INPUT_CAPTURE_2" />
         <interrupt caption="Output Compare 2" index="12" module-instance="OUTPUT_COMPARE_2" name="OUTPUT_COMPARE_2" />
         <interrupt caption="External Interrupt 2" index="13" module-instance="EXTERNAL_2" name="EXTERNAL_2" />
         <interrupt caption="Timer3" index="14" module-instance="TIMER_3" name="TIMER_3" />
         <interrupt caption="Input Capture 3 Error" index="15" module-instance="INPUT_CAPTURE_3_ERROR" name="INPUT_CAPTURE_3_ERROR" />
         <interrupt caption="Input Capture 3" index="16" module-instance="INPUT_CAPTURE_3" name="INPUT_CAPTURE_3" />
         <interrupt caption="Output Compare 3" index="17" module-instance="OUTPUT_COMPARE_3" name="OUTPUT_COMPARE_3" />
         <interrupt caption="External Interrupt 3" index="18" module-instance="EXTERNAL_3" name="EXTERNAL_3" />
         <interrupt caption="Timer4" index="19" module-instance="TIMER_4" name="TIMER_4" />
         <interrupt caption="Input Capture 4 Error" index="20" module-instance="INPUT_CAPTURE_4_ERROR" name="INPUT_CAPTURE_4_ERROR" />
         <interrupt caption="Input Capture 4" index="21" module-instance="INPUT_CAPTURE_4" name="INPUT_CAPTURE_4" />
         <interrupt caption="Output Compare 4" index="22" module-instance="OUTPUT_COMPARE_4" name="OUTPUT_COMPARE_4" />
         <interrupt caption="External Interrupt 4" index="23" module-instance="EXTERNAL_4" name="EXTERNAL_4" />
         <interrupt caption="Timer5" index="24" module-instance="TIMER_5" name="TIMER_5" />
         <interrupt caption="Input Capture 5 Error" index="25" module-instance="INPUT_CAPTURE_5_ERROR" name="INPUT_CAPTURE_5_ERROR" />
         <interrupt caption="Input Capture 5" index="26" module-instance="INPUT_CAPTURE_5" name="INPUT_CAPTURE_5" />
         <interrupt caption="Output Compare 5" index="27" module-instance="OUTPUT_COMPARE_5" name="OUTPUT_COMPARE_5" />
         <interrupt caption="Real Time Clock" index="30" module-instance="RTCC" name="RTCC" />
         <interrupt caption="Flash Control Event" index="31" module-instance="FLASH_CONTROL" name="FLASH_CONTROL" />
         <interrupt caption="Comparator 1 Interrupt" index="32" module-instance="COMPARATOR_1" name="COMPARATOR_1" />
         <interrupt caption="Comparator 2 Interrupt" index="33" module-instance="COMPARATOR_2" name="COMPARATOR_2" />
         <interrupt caption="USB1 Interrupts" index="34" module-instance="USB_1" name="USB_1" />
         <interrupt caption="SPI1 Fault" index="35" module-instance="SPI1_FAULT" name="SPI1_FAULT" />
         <interrupt caption="SPI1 Receive Done" index="36" module-instance="SPI1_RX" name="SPI1_RX" />
         <interrupt caption="SPI1 Transfer Done" index="37" module-instance="SPI1_TX" name="SPI1_TX" />
         <interrupt caption="UART1 Fault" index="38" module-instance="UART1_FAULT" name="UART1_FAULT" />
         <interrupt caption="UART1 Receive Done" index="39" module-instance="UART1_RX" name="UART1_RX" />
         <interrupt caption="UART1 Transfer Done" index="40" module-instance="UART1_TX" name="UART1_TX" />
         <interrupt caption="I2C1 Bus Collision Event" index="41" module-instance="I2C1_BUS" name="I2C1_BUS" />
         <interrupt caption="I2C1 Slave Event" index="42" module-instance="I2C1_SLAVE" name="I2C1_SLAVE" />
         <interrupt caption="I2C1 Master Event" index="43" module-instance="I2C1_MASTER" name="I2C1_MASTER" />
         <interrupt caption="PORTA Input Change Interrupt" index="44" module-instance="CHANGE_NOTICE_A" name="CHANGE_NOTICE_A" />
         <interrupt caption="PORTB Input Change Interrupt" index="45" module-instance="CHANGE_NOTICE_B" name="CHANGE_NOTICE_B" />
         <interrupt caption="PORTC Input Change Interrupt" index="46" module-instance="CHANGE_NOTICE_C" name="CHANGE_NOTICE_C" />
         <interrupt caption="PORTD Input Change Interrupt" index="47" module-instance="CHANGE_NOTICE_D" name="CHANGE_NOTICE_D" />
         <interrupt caption="PORTE Input Change Interrupt" index="48" module-instance="CHANGE_NOTICE_E" name="CHANGE_NOTICE_E" />
         <interrupt caption="PORTF Input Change Interrupt" index="49" module-instance="CHANGE_NOTICE_F" name="CHANGE_NOTICE_F" />
         <interrupt caption="PORTG Input Change Interrupt" index="50" module-instance="CHANGE_NOTICE_G" name="CHANGE_NOTICE_G" />
         <interrupt caption="Parallel Master Port" index="51" module-instance="PMP" name="PMP" />
         <interrupt caption="Parallel Master Port Error" index="52" module-instance="PMP_ERROR" name="PMP_ERROR" />
         <interrupt caption="SPI2 Fault" index="53" module-instance="SPI2_FAULT" name="SPI2_FAULT" />
         <interrupt caption="SPI2 Receive Done" index="54" module-instance="SPI2_RX" name="SPI2_RX" />
         <interrupt caption="SPI2 Transfer Done" index="55" module-instance="SPI2_TX" name="SPI2_TX" />
         <interrupt caption="UART2 Fault" index="56" module-instance="UART2_FAULT" name="UART2_FAULT" />
         <interrupt caption="UART2 Receive Done" index="57" module-instance="UART2_RX" name="UART2_RX" />
         <interrupt caption="UART2 Transfer Done" index="58" module-instance="UART2_TX" name="UART2_TX" />
         <interrupt caption="I2C2 Bus Collision Event" index="59" module-instance="I2C2_BUS" name="I2C2_BUS" />
         <interrupt caption="I2C2 Slave Event" index="60" module-instance="I2C2_SLAVE" name="I2C2_SLAVE" />
         <interrupt caption="I2C2 Master Event" index="61" module-instance="I2C2_MASTER" name="I2C2_MASTER" />
         <interrupt caption="UART3 Fault" index="62" module-instance="UART3_FAULT" name="UART3_FAULT" />
         <interrupt caption="UART3 Receive Done" index="63" module-instance="UART3_RX" name="UART3_RX" />
         <interrupt caption="UART3 Transfer Done" index="64" module-instance="UART3_TX" name="UART3_TX" />
         <interrupt caption="UART4 Fault" index="65" module-instance="UART4_FAULT" name="UART4_FAULT" />
         <interrupt caption="UART4 Receive Done" index="66" module-instance="UART4_RX" name="UART4_RX" />
         <interrupt caption="UART4 Transfer Done" index="67" module-instance="UART4_TX" name="UART4_TX" />
         <interrupt caption="UART5 Fault" index="68" module-instance="UART5_FAULT" name="UART5_FAULT" />
         <interrupt caption="UART5 Receive Done" index="69" module-instance="UART5_RX" name="UART5_RX" />
         <interrupt caption="UART5 Transfer Done" index="70" module-instance="UART5_TX" name="UART5_TX" />
         <interrupt caption="CTMU Interrupt" index="71" module-instance="CTMU" name="CTMU" />
         <interrupt caption="DMA Channel 0" index="72" module-instance="DMA0" name="DMA0" />
         <interrupt caption="DMA Channel 1" index="73" module-instance="DMA1" name="DMA1" />
         <interrupt caption="DMA Channel 2" index="74" module-instance="DMA2" name="DMA2" />
         <interrupt caption="DMA Channel 3" index="75" module-instance="DMA3" name="DMA3" />
         <interrupt caption="Timer6" index="76" module-instance="TIMER_6" name="TIMER_6" />
         <interrupt caption="Input Capture 6 Error" index="77" module-instance="INPUT_CAPTURE_6_ERROR" name="INPUT_CAPTURE_6_ERROR" />
         <interrupt caption="Input Capture 6" index="78" module-instance="INPUT_CAPTURE_6" name="INPUT_CAPTURE_6" />
         <interrupt caption="Output Compare 6" index="79" module-instance="OUTPUT_COMPARE_6" name="OUTPUT_COMPARE_6" />
         <interrupt caption="Timer7" index="80" module-instance="TIMER_7" name="TIMER_7" />
         <interrupt caption="Input Capture 7 Error" index="81" module-instance="INPUT_CAPTURE_7_ERROR" name="INPUT_CAPTURE_7_ERROR" />
         <interrupt caption="Input Capture 7" index="82" module-instance="INPUT_CAPTURE_7" name="INPUT_CAPTURE_7" />
         <interrupt caption="Output Compare 7" index="83" module-instance="OUTPUT_COMPARE_7" name="OUTPUT_COMPARE_7" />
         <interrupt caption="Timer8" index="84" module-instance="TIMER_8" name="TIMER_8" />
         <interrupt caption="Input Capture 8 Error" index="85" module-instance="INPUT_CAPTURE_8_ERROR" name="INPUT_CAPTURE_8_ERROR" />
         <interrupt caption="Input Capture 8" index="86" module-instance="INPUT_CAPTURE_8" name="INPUT_CAPTURE_8" />
         <interrupt caption="Output Compare 8" index="87" module-instance="OUTPUT_COMPARE_8" name="OUTPUT_COMPARE_8" />
         <interrupt caption="Timer9" index="88" module-instance="TIMER_9" name="TIMER_9" />
         <interrupt caption="Input Capture 9 Error" index="89" module-instance="INPUT_CAPTURE_9_ERROR" name="INPUT_CAPTURE_9_ERROR" />
         <interrupt caption="Input Capture 9" index="90" module-instance="INPUT_CAPTURE_9" name="INPUT_CAPTURE_9" />
         <interrupt caption="Output Compare 9" index="91" module-instance="OUTPUT_COMPARE_9" name="OUTPUT_COMPARE_9" />
         <interrupt caption="ADC Global Interrupt" index="92" module-instance="ADC" name="ADC" />
         <interrupt caption="ADC Digital Comparator 1" index="94" module-instance="ADC_DC1" name="ADC_DC1" />
         <interrupt caption="ADC Digital Comparator 2" index="95" module-instance="ADC_DC2" name="ADC_DC2" />
         <interrupt caption="ADC Digital Filter 1" index="96" module-instance="ADC_DF1" name="ADC_DF1" />
         <interrupt caption="ADC Digital Filter 2" index="97" module-instance="ADC_DF2" name="ADC_DF2" />
         <interrupt caption="ADC Digital Filter 3" index="98" module-instance="ADC_DF3" name="ADC_DF3" />
         <interrupt caption="ADC Digital Filter 4" index="99" module-instance="ADC_DF4" name="ADC_DF4" />
         <interrupt caption="ADC Fault" index="100" module-instance="ADC_FAULT" name="ADC_FAULT" />
         <interrupt caption="ADC End of Scan" index="101" module-instance="ADC_EOS" name="ADC_EOS" />
         <interrupt caption="ADC Ready" index="102" module-instance="ADC_ARDY" name="ADC_ARDY" />
         <interrupt caption="ADC Update Ready After Suspend" index="103" module-instance="ADC_URDY" name="ADC_URDY" />
         <interrupt caption="ADC First Class Channels DMA" index="104" module-instance="ADC_DMA" name="ADC_DMA" />
         <interrupt caption="ADC Early Group Interrupt" index="105" module-instance="ADC_EARLY" name="ADC_EARLY" />
         <interrupt caption="ADC Data 0" index="106" module-instance="ADC_DATA0" name="ADC_DATA0" />
         <interrupt caption="ADC Data 1" index="107" module-instance="ADC_DATA1" name="ADC_DATA1" />
         <interrupt caption="ADC Data 2" index="108" module-instance="ADC_DATA2" name="ADC_DATA2" />
         <interrupt caption="ADC Data 3" index="109" module-instance="ADC_DATA3" name="ADC_DATA3" />
         <interrupt caption="ADC Data 4" index="110" module-instance="ADC_DATA4" name="ADC_DATA4" />
         <interrupt caption="ADC Data 5" index="111" module-instance="ADC_DATA5" name="ADC_DATA5" />
         <interrupt caption="ADC Data 6" index="112" module-instance="ADC_DATA6" name="ADC_DATA6" />
         <interrupt caption="ADC Data 7" index="113" module-instance="ADC_DATA7" name="ADC_DATA7" />
         <interrupt caption="ADC Data 8" index="114" module-instance="ADC_DATA8" name="ADC_DATA8" />
         <interrupt caption="ADC Data 9" index="115" module-instance="ADC_DATA9" name="ADC_DATA9" />
         <interrupt caption="ADC Data 10" index="116" module-instance="ADC_DATA10" name="ADC_DATA10" />
         <interrupt caption="ADC Data 11" index="117" module-instance="ADC_DATA11" name="ADC_DATA11" />
         <interrupt caption="ADC Data 12" index="118" module-instance="ADC_DATA12" name="ADC_DATA12" />
         <interrupt caption="ADC Data 13" index="119" module-instance="ADC_DATA13" name="ADC_DATA13" />
         <interrupt caption="ADC Data 14" index="120" module-instance="ADC_DATA14" name="ADC_DATA14" />
         <interrupt caption="ADC Data 15" index="121" module-instance="ADC_DATA15" name="ADC_DATA15" />
         <interrupt caption="ADC Data 16" index="122" module-instance="ADC_DATA16" name="ADC_DATA16" />
         <interrupt caption="ADC Data 17" index="123" module-instance="ADC_DATA17" name="ADC_DATA17" />
         <interrupt caption="ADC Data 18" index="124" module-instance="ADC_DATA18" name="ADC_DATA18" />
         <interrupt caption="ADC Data 19" index="125" module-instance="ADC_DATA19" name="ADC_DATA19" />
         <interrupt caption="ADC Data 24" index="130" module-instance="ADC_DATA24" name="ADC_DATA24" />
         <interrupt caption="ADC Data 25" index="131" module-instance="ADC_DATA25" name="ADC_DATA25" />
         <interrupt caption="ADC Data 26" index="132" module-instance="ADC_DATA26" name="ADC_DATA26" />
         <interrupt caption="ADC Data 27" index="133" module-instance="ADC_DATA27" name="ADC_DATA27" />
         <interrupt caption="ADC Data 48" index="154" module-instance="ADC_DATA48" name="ADC_DATA48" />
         <interrupt caption="ADC Data 49" index="155" module-instance="ADC_DATA49" name="ADC_DATA49" />
         <interrupt caption="ADC Data 50" index="156" module-instance="ADC_DATA50" name="ADC_DATA50" />
         <interrupt caption="ADC Data 51" index="157" module-instance="ADC_DATA51" name="ADC_DATA51" />
         <interrupt caption="ADC Data 52" index="158" module-instance="ADC_DATA52" name="ADC_DATA52" />
         <interrupt caption="ADC Data 53" index="159" module-instance="ADC_DATA53" name="ADC_DATA53" />
         <interrupt caption="Comparator 3 Interrupt" index="160" module-instance="COMPARATOR_3" name="COMPARATOR_3" />
         <interrupt caption="Comparator 4 Interrupt" index="161" module-instance="COMPARATOR_4" name="COMPARATOR_4" />
         <interrupt caption="Comparator 5 Interrupt" index="162" module-instance="COMPARATOR_5" name="COMPARATOR_5" />
         <interrupt caption="UART6 Fault" index="164" module-instance="UART6_FAULT" name="UART6_FAULT" />
         <interrupt caption="UART6 Receive Done" index="165" module-instance="UART6_RX" name="UART6_RX" />
         <interrupt caption="UART6 Transfer Done" index="166" module-instance="UART6_TX" name="UART6_TX" />
         <interrupt caption="CAN1 Global Interrupt" index="167" module-instance="CAN1" name="CAN1" />
         <interrupt caption="CAN2 Global Interrupt" index="168" module-instance="CAN2" name="CAN2" />
         <interrupt caption="I2C3 Bus Collision Event" index="179" module-instance="I2C3_BUS" name="I2C3_BUS" />
         <interrupt caption="I2C3 Slave Event" index="180" module-instance="I2C3_SLAVE" name="I2C3_SLAVE" />
         <interrupt caption="I2C3 Master Event" index="181" module-instance="I2C3_MASTER" name="I2C3_MASTER" />
         <interrupt caption="DMA Channel 4" index="182" module-instance="DMA4" name="DMA4" />
         <interrupt caption="DMA Channel 5" index="183" module-instance="DMA5" name="DMA5" />
         <interrupt caption="DMA Channel 6" index="184" module-instance="DMA6" name="DMA6" />
         <interrupt caption="DMA Channel 7" index="185" module-instance="DMA7" name="DMA7" />
         <interrupt caption="Data EEPROM Global Interrupt" index="186" module-instance="DATA_EE" name="DATA_EE" />
         <interrupt caption="CAN3 Global Interrupt" index="187" module-instance="CAN3" name="CAN3" />
         <interrupt caption="CAN4 Global Interrupt" index="188" module-instance="CAN4" name="CAN4" />
         <interrupt caption="I2C4 Bus Collision Event" index="194" module-instance="I2C4_BUS" name="I2C4_BUS" />
         <interrupt caption="I2C4 Slave Event" index="195" module-instance="I2C4_SLAVE" name="I2C4_SLAVE" />
         <interrupt caption="I2C4 Master Event" index="196" module-instance="I2C4_MASTER" name="I2C4_MASTER" />
         <interrupt caption="Input Capture 10 Error" index="197" module-instance="INPUT_CAPTURE_10_ERROR" name="INPUT_CAPTURE_10_ERROR" />
         <interrupt caption="Input Capture 10" index="198" module-instance="INPUT_CAPTURE_10" name="INPUT_CAPTURE_10" />
         <interrupt caption="Output Compare 10" index="199" module-instance="OUTPUT_COMPARE_10" name="OUTPUT_COMPARE_10" />
         <interrupt caption="Input Capture 11 Error" index="200" module-instance="INPUT_CAPTURE_11_ERROR" name="INPUT_CAPTURE_11_ERROR" />
         <interrupt caption="Input Capture 11" index="201" module-instance="INPUT_CAPTURE_11" name="INPUT_CAPTURE_11" />
         <interrupt caption="Output Compare 11" index="202" module-instance="OUTPUT_COMPARE_11" name="OUTPUT_COMPARE_11" />
         <interrupt caption="Input Capture 12 Error" index="203" module-instance="INPUT_CAPTURE_12_ERROR" name="INPUT_CAPTURE_12_ERROR" />
         <interrupt caption="Input Capture 12" index="204" module-instance="INPUT_CAPTURE_12" name="INPUT_CAPTURE_12" />
         <interrupt caption="Output Compare 12" index="205" module-instance="OUTPUT_COMPARE_12" name="OUTPUT_COMPARE_12" />
         <interrupt caption="Input Capture 13 Error" index="206" module-instance="INPUT_CAPTURE_13_ERROR" name="INPUT_CAPTURE_13_ERROR" />
         <interrupt caption="Input Capture 13" index="207" module-instance="INPUT_CAPTURE_13" name="INPUT_CAPTURE_13" />
         <interrupt caption="Output Compare 13" index="208" module-instance="OUTPUT_COMPARE_13" name="OUTPUT_COMPARE_13" />
         <interrupt caption="Input Capture 14 Error" index="209" module-instance="INPUT_CAPTURE_14_ERROR" name="INPUT_CAPTURE_14_ERROR" />
         <interrupt caption="Input Capture 14" index="210" module-instance="INPUT_CAPTURE_14" name="INPUT_CAPTURE_14" />
         <interrupt caption="Output Compare 14" index="211" module-instance="OUTPUT_COMPARE_14" name="OUTPUT_COMPARE_14" />
         <interrupt caption="Input Capture 15 Error" index="212" module-instance="INPUT_CAPTURE_15_ERROR" name="INPUT_CAPTURE_15_ERROR" />
         <interrupt caption="Input Capture 15" index="213" module-instance="INPUT_CAPTURE_15" name="INPUT_CAPTURE_15" />
         <interrupt caption="Output Compare 15" index="214" module-instance="OUTPUT_COMPARE_15" name="OUTPUT_COMPARE_15" />
         <interrupt caption="Input Capture 16 Error" index="215" module-instance="INPUT_CAPTURE_16_ERROR" name="INPUT_CAPTURE_16_ERROR" />
         <interrupt caption="Input Capture 16" index="216" module-instance="INPUT_CAPTURE_16" name="INPUT_CAPTURE_16" />
         <interrupt caption="Output Compare 16" index="217" module-instance="OUTPUT_COMPARE_16" name="OUTPUT_COMPARE_16" />
         <interrupt caption="SPI3 Fault" index="218" module-instance="SPI3_FAULT" name="SPI3_FAULT" />
         <interrupt caption="SPI3 Receive Done" index="219" module-instance="SPI3_RX" name="SPI3_RX" />
         <interrupt caption="SPI3 Transfer Done" index="220" module-instance="SPI3_TX" name="SPI3_TX" />
         <interrupt caption="SPI4 Fault" index="221" module-instance="SPI4_FAULT" name="SPI4_FAULT" />
         <interrupt caption="SPI4 Receive Done" index="222" module-instance="SPI4_RX" name="SPI4_RX" />
         <interrupt caption="SPI4 Transfer Done" index="223" module-instance="SPI4_TX" name="SPI4_TX" />
         <interrupt caption="SPI5 Fault" index="224" module-instance="SPI5_FAULT" name="SPI5_FAULT" />
         <interrupt caption="SPI5 Receive Done" index="225" module-instance="SPI5_RX" name="SPI5_RX" />
         <interrupt caption="SPI5 Transfer Done" index="226" module-instance="SPI5_TX" name="SPI5_TX" />
         <interrupt caption="SPI6 Fault" index="227" module-instance="SPI6_FAULT" name="SPI6_FAULT" />
         <interrupt caption="SPI6 Receive Done" index="228" module-instance="SPI6_RX" name="SPI6_RX" />
         <interrupt caption="SPI6 Transfer Done" index="229" module-instance="SPI6_TX" name="SPI6_TX" />
         <interrupt caption="System Bus Protection Violation" index="230" module-instance="SYSTEM_BUS_PROTECTION" name="SYSTEM_BUS_PROTECTION" />
         <interrupt caption="ADC Digital Comparator 3" index="245" module-instance="ADC_DC3" name="ADC_DC3" />
         <interrupt caption="ADC Digital Comparator 4" index="246" module-instance="ADC_DC4" name="ADC_DC4" />
         <interrupt caption="MPU Core Performance Counter Event" index="254" module-instance="CORE_PERF_COUNT" name="CORE_PERF_COUNT" />
         <interrupt caption="Core Fast Debug Channel" index="255" module-instance="CORE_FAST_DEBUG_CHAN" name="CORE_FAST_DEBUG_CHAN" />
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
