Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK1024GPE064.atdf
      <value-group caption="Digital Filter 'x' Interrupt Enable bit" name="ADCFLTR2__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR2__OVRSAM">
         <value caption="128 samples (shift sum 3 bits to right output data is in 15.1 format)" name="" value="0x7" />
         <value caption="32 samples (shift sum 2 bits to right output data is in 14.1 format)" name="" value="0x6" />
         <value caption="8 samples (shift sum 1 bit to right output data is in 13.1 format)" name="" value="0x5" />
         <value caption="2 samples (shift sum 0 bits to right output data is in 12.1 format)" name="" value="0x4" />
         <value caption="256 samples (shift sum 4 bits to right output data is 16 bits)" name="" value="0x3" />
         <value caption="64 samples (shift sum 3 bits to right output data is 15 bits)" name="" value="0x2" />
         <value caption="16 samples (shift sum 2 bits to right output data is 14 bits)" name="" value="0x1" />
         <value caption="4 samples (shift sum 1 bit to right output data is 13 bits)" name="" value="0x0" />
         <value caption="256 samples (256 samples to be averaged)" name="" value="0x7" />
         <value caption="128 samples (128 samples to be averaged)" name="" value="0x6" />
         <value caption="64 samples (64 samples to be averaged)" name="" value="0x5" />
         <value caption="32 samples (32 samples to be averaged)" name="" value="0x4" />
         <value caption="16 samples (16 samples to be averaged)" name="" value="0x3" />
         <value caption="8 samples (8 samples to be averaged)" name="" value="0x2" />
         <value caption="4 samples (4 samples to be averaged)" name="" value="0x1" />
         <value caption="2 samples (2 samples to be averaged)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR2__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR2__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1" />
         <value caption="Only the first 12 bits are significant" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Enable bit" name="ADCFLTR2__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1" />
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR3__CHNLID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="AN27 input" name="" value="0x1b" />
         <value caption="AN26 input" name="" value="0x1a" />
         <value caption="AN25 input" name="" value="0x19" />
         <value caption="AN24 input" name="" value="0x18" />
         <value caption="AN23 input" name="" value="0x17" />
         <value caption="AN22 input" name="" value="0x16" />
         <value caption="AN21 input" name="" value="0x15" />
         <value caption="AN20 input" name="" value="0x14" />
         <value caption="AN19 input" name="" value="0x13" />
         <value caption="AN6 input" name="" value="0x16" />
         <value caption="ADC5 Module" name="" value="0x5" />
         <value caption="ADC4 Module" name="" value="0x4" />
         <value caption="ADC3 Module" name="" value="0x3" />
         <value caption="ADC2 Module" name="" value="0x2" />
         <value caption="ADC1 Module" name="" value="0x1" />
         <value caption="ADC0 Module" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Data Ready Status bit" name="ADCFLTR3__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1" />
         <value caption="Data is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Interrupt Enable bit" name="ADCFLTR3__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR3__OVRSAM">
         <value caption="128 samples (shift sum 3 bits to right output data is in 15.1 format)" name="" value="0x7" />
         <value caption="32 samples (shift sum 2 bits to right output data is in 14.1 format)" name="" value="0x6" />
         <value caption="8 samples (shift sum 1 bit to right output data is in 13.1 format)" name="" value="0x5" />
         <value caption="2 samples (shift sum 0 bits to right output data is in 12.1 format)" name="" value="0x4" />
         <value caption="256 samples (shift sum 4 bits to right output data is 16 bits)" name="" value="0x3" />
         <value caption="64 samples (shift sum 3 bits to right output data is 15 bits)" name="" value="0x2" />
         <value caption="16 samples (shift sum 2 bits to right output data is 14 bits)" name="" value="0x1" />
         <value caption="4 samples (shift sum 1 bit to right output data is 13 bits)" name="" value="0x0" />
         <value caption="256 samples (256 samples to be averaged)" name="" value="0x7" />
         <value caption="128 samples (128 samples to be averaged)" name="" value="0x6" />
         <value caption="64 samples (64 samples to be averaged)" name="" value="0x5" />
         <value caption="32 samples (32 samples to be averaged)" name="" value="0x4" />
         <value caption="16 samples (16 samples to be averaged)" name="" value="0x3" />
         <value caption="8 samples (8 samples to be averaged)" name="" value="0x2" />
         <value caption="4 samples (4 samples to be averaged)" name="" value="0x1" />
         <value caption="2 samples (2 samples to be averaged)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR3__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR3__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1" />
         <value caption="Only the first 12 bits are significant" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Enable bit" name="ADCFLTR3__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1" />
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR4__CHNLID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="AN27 input" name="" value="0x1b" />
         <value caption="AN26 input" name="" value="0x1a" />
         <value caption="AN25 input" name="" value="0x19" />
         <value caption="AN24 input" name="" value="0x18" />
         <value caption="AN23 input" name="" value="0x17" />
         <value caption="AN22 input" name="" value="0x16" />
         <value caption="AN21 input" name="" value="0x15" />
         <value caption="AN20 input" name="" value="0x14" />
         <value caption="AN19 input" name="" value="0x13" />
         <value caption="AN6 input" name="" value="0x16" />
         <value caption="ADC5 Module" name="" value="0x5" />
         <value caption="ADC4 Module" name="" value="0x4" />
         <value caption="ADC3 Module" name="" value="0x3" />
         <value caption="ADC2 Module" name="" value="0x2" />
         <value caption="ADC1 Module" name="" value="0x1" />
         <value caption="ADC0 Module" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Data Ready Status bit" name="ADCFLTR4__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1" />
         <value caption="Data is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Interrupt Enable bit" name="ADCFLTR4__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR4__OVRSAM">
         <value caption="128 samples (shift sum 3 bits to right output data is in 15.1 format)" name="" value="0x7" />
         <value caption="32 samples (shift sum 2 bits to right output data is in 14.1 format)" name="" value="0x6" />
         <value caption="8 samples (shift sum 1 bit to right output data is in 13.1 format)" name="" value="0x5" />
         <value caption="2 samples (shift sum 0 bits to right output data is in 12.1 format)" name="" value="0x4" />
         <value caption="256 samples (shift sum 4 bits to right output data is 16 bits)" name="" value="0x3" />
         <value caption="64 samples (shift sum 3 bits to right output data is 15 bits)" name="" value="0x2" />
         <value caption="16 samples (shift sum 2 bits to right output data is 14 bits)" name="" value="0x1" />
         <value caption="4 samples (shift sum 1 bit to right output data is 13 bits)" name="" value="0x0" />
         <value caption="256 samples (256 samples to be averaged)" name="" value="0x7" />
         <value caption="128 samples (128 samples to be averaged)" name="" value="0x6" />
         <value caption="64 samples (64 samples to be averaged)" name="" value="0x5" />
         <value caption="32 samples (32 samples to be averaged)" name="" value="0x4" />
         <value caption="16 samples (16 samples to be averaged)" name="" value="0x3" />
         <value caption="8 samples (8 samples to be averaged)" name="" value="0x2" />
         <value caption="4 samples (4 samples to be averaged)" name="" value="0x1" />
         <value caption="2 samples (2 samples to be averaged)" name="" value="0x0" />
      </value-group>
