Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK1024GPE064.atdf
         <register caption="CAN Acceptance Filter " name="C4RXF6" offset="0x51a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXF6__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C4RXF6__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXF6__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF7" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF7__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF7__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF7__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF7" offset="0x11b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF7__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF7__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF7__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C3RXF7" offset="0x41b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXF7__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C3RXF7__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXF7__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C4RXF7" offset="0x51b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXF7__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C4RXF7__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXF7__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF8" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF8__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF8__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF8__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF8" offset="0x11c0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF8__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF8__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF8__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C3RXF8" offset="0x41c0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXF8__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C3RXF8__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXF8__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C4RXF8" offset="0x51c0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXF8__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C4RXF8__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXF8__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF9" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF9__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF9__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF9__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF9" offset="0x11d0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF9__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF9__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF9__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C3RXF9" offset="0x41d0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXF9__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C3RXF9__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXF9__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C4RXF9" offset="0x51d0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXF9__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C4RXF9__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXF9__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF10" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF10__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF10__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF10__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF10" offset="0x11e0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF10__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF10__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF10__SID" />
         </register>
