Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK1024GPE064.atdf
         <register caption="CAN FIFO User Address Register " name="C2FIFOUA14" offset="0x16f0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C3FIFOUA14" offset="0x46f0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C4FIFOUA14" offset="0x56f0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN Module Message Index Register " name="C1FIFOCI14" offset="0x700" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C2FIFOCI14" offset="0x1700" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C3FIFOCI14" offset="0x4700" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C4FIFOCI14" offset="0x5700" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN FIFO Control Register " name="C1FIFOCON15" offset="0x710" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON15__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON15__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON15__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON15__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON15__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON15__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON15__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON15__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON15__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON15__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON15__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C2FIFOCON15" offset="0x1710" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C2FIFOCON15__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C2FIFOCON15__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C2FIFOCON15__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C2FIFOCON15__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C2FIFOCON15__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C2FIFOCON15__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C2FIFOCON15__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C2FIFOCON15__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C2FIFOCON15__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C2FIFOCON15__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C2FIFOCON15__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C3FIFOCON15" offset="0x4710" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C3FIFOCON15__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C3FIFOCON15__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C3FIFOCON15__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C3FIFOCON15__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C3FIFOCON15__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C3FIFOCON15__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C3FIFOCON15__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C3FIFOCON15__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C3FIFOCON15__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C3FIFOCON15__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C3FIFOCON15__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C4FIFOCON15" offset="0x5710" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C4FIFOCON15__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C4FIFOCON15__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C4FIFOCON15__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C4FIFOCON15__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C4FIFOCON15__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C4FIFOCON15__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C4FIFOCON15__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C4FIFOCON15__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C4FIFOCON15__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C4FIFOCON15__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C4FIFOCON15__FSIZE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT15" offset="0x720" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT15__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT15__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT15__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT15__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT15__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT15__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT15__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT15__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT15__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT15__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT15__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT15__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT15__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT15__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C2FIFOINT15" offset="0x1720" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C2FIFOINT15__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C2FIFOINT15__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C2FIFOINT15__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C2FIFOINT15__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C2FIFOINT15__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C2FIFOINT15__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C2FIFOINT15__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C2FIFOINT15__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C2FIFOINT15__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C2FIFOINT15__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C2FIFOINT15__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C2FIFOINT15__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C2FIFOINT15__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C2FIFOINT15__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C3FIFOINT15" offset="0x4720" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C3FIFOINT15__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C3FIFOINT15__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C3FIFOINT15__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C3FIFOINT15__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C3FIFOINT15__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C3FIFOINT15__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C3FIFOINT15__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C3FIFOINT15__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C3FIFOINT15__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C3FIFOINT15__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C3FIFOINT15__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C3FIFOINT15__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C3FIFOINT15__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C3FIFOINT15__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C4FIFOINT15" offset="0x5720" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C4FIFOINT15__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C4FIFOINT15__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C4FIFOINT15__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C4FIFOINT15__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C4FIFOINT15__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C4FIFOINT15__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C4FIFOINT15__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C4FIFOINT15__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C4FIFOINT15__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C4FIFOINT15__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C4FIFOINT15__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C4FIFOINT15__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C4FIFOINT15__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C4FIFOINT15__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C1FIFOUA15" offset="0x730" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C2FIFOUA15" offset="0x1730" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C3FIFOUA15" offset="0x4730" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C4FIFOUA15" offset="0x5730" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN Module Message Index Register " name="C1FIFOCI15" offset="0x740" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C2FIFOCI15" offset="0x1740" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C3FIFOCI15" offset="0x4740" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C4FIFOCI15" offset="0x5740" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
      </register-group>
      <value-group caption="Device Net Filter Bit Number bits" name="C1CON__DNCNT">
         <value caption="Invalid Selection (compare up to 18-bits of data with EID)" name="" value="10011-11111" />
         <value caption="Compare up to data byte 2 bit 6 with EID17 (CiRXFn)" name="" value="0x12" />
         <value caption="Compare up to data byte 0 bit 7 with EID0 (CiRXFn)" name="" value="0x1" />
         <value caption="Do not compare data bytes" name="" value="0x0" />
      </value-group>
