Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK1024GPE064.atdf
         <register caption="" name="PMD3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="IC1MD" />
            <bitfield mask="0x00000002" name="IC2MD" />
            <bitfield mask="0x00000004" name="IC3MD" />
            <bitfield mask="0x00000008" name="IC4MD" />
            <bitfield mask="0x00000010" name="IC5MD" />
            <bitfield mask="0x00000020" name="IC6MD" />
            <bitfield mask="0x00000040" name="IC7MD" />
            <bitfield mask="0x00000080" name="IC8MD" />
            <bitfield mask="0x00000100" name="IC9MD" />
            <bitfield mask="0x00000200" name="IC10MD" />
            <bitfield mask="0x00000400" name="IC11MD" />
            <bitfield mask="0x00000800" name="IC12MD" />
            <bitfield mask="0x00001000" name="IC13MD" />
            <bitfield mask="0x00002000" name="IC14MD" />
            <bitfield mask="0x00004000" name="IC15MD" />
            <bitfield mask="0x00008000" name="IC16MD" />
            <bitfield mask="0x00010000" name="OC1MD" />
            <bitfield mask="0x00020000" name="OC2MD" />
            <bitfield mask="0x00040000" name="OC3MD" />
            <bitfield mask="0x00080000" name="OC4MD" />
            <bitfield mask="0x00100000" name="OC5MD" />
            <bitfield mask="0x00200000" name="OC6MD" />
            <bitfield mask="0x00400000" name="OC7MD" />
            <bitfield mask="0x00800000" name="OC8MD" />
            <bitfield mask="0x01000000" name="OC9MD" />
            <bitfield mask="0x02000000" name="OC10MD" />
            <bitfield mask="0x04000000" name="OC11MD" />
            <bitfield mask="0x08000000" name="OC12MD" />
            <bitfield mask="0x10000000" name="OC13MD" />
            <bitfield mask="0x20000000" name="OC14MD" />
            <bitfield mask="0x40000000" name="OC15MD" />
            <bitfield mask="0x80000000" name="OC16MD" />
         </register>
         <register caption="" name="PMD4" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T1MD" />
            <bitfield mask="0x00000002" name="T2MD" />
            <bitfield mask="0x00000004" name="T3MD" />
            <bitfield mask="0x00000008" name="T4MD" />
            <bitfield mask="0x00000010" name="T5MD" />
            <bitfield mask="0x00000020" name="T6MD" />
            <bitfield mask="0x00000040" name="T7MD" />
            <bitfield mask="0x00000080" name="T8MD" />
            <bitfield mask="0x00000100" name="T9MD" />
         </register>
         <register caption="" name="PMD5" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U1MD" />
            <bitfield mask="0x00000002" name="U2MD" />
            <bitfield mask="0x00000004" name="U3MD" />
            <bitfield mask="0x00000008" name="U4MD" />
            <bitfield mask="0x00000010" name="U5MD" />
            <bitfield mask="0x00000020" name="U6MD" />
            <bitfield mask="0x00000100" name="SPI1MD" />
            <bitfield mask="0x00000200" name="SPI2MD" />
            <bitfield mask="0x00000400" name="SPI3MD" />
            <bitfield mask="0x00000800" name="SPI4MD" />
            <bitfield mask="0x00001000" name="SPI5MD" />
            <bitfield mask="0x00002000" name="SPI6MD" />
            <bitfield mask="0x00010000" name="I2C1MD" />
            <bitfield mask="0x00020000" name="I2C2MD" />
            <bitfield mask="0x00040000" name="I2C3MD" />
            <bitfield mask="0x00080000" name="I2C4MD" />
            <bitfield mask="0x01000000" name="USB1MD" />
            <bitfield mask="0x02000000" name="USB2MD" />
            <bitfield mask="0x10000000" name="CAN1MD" />
            <bitfield mask="0x20000000" name="CAN2MD" />
            <bitfield mask="0x40000000" name="CAN3MD" />
            <bitfield mask="0x80000000" name="CAN4MD" />
         </register>
         <register caption="" name="PMD6" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000100" name="REFO1MD" />
            <bitfield mask="0x00000200" name="REFO2MD" />
            <bitfield mask="0x00000400" name="REFO3MD" />
            <bitfield mask="0x00000800" name="REFO4MD" />
            <bitfield mask="0x00010000" name="PMPMD" />
         </register>
         <register caption="" name="PMD7" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="DMAMD" />
         </register>
         <register caption="Permission Group Configuration Register" name="CFGPG" offset="0xe0" rw="RW" size="4">
            <bitfield caption="CPU Permission Group bits" mask="0x00000003" name="CPUPG" values="CFGPG__CPUPG" />
            <bitfield caption="DMA Module Permission Group bits" mask="0x00000030" name="DMAPG" values="CFGPG__DMAPG" />
            <bitfield caption="USB1 Module Permission Group bits" mask="0x00000300" name="USB1PG" values="CFGPG__USB1PG" />
            <bitfield caption="USB2 Module Permission Group bits" mask="0x00000C00" name="USB2PG" values="CFGPG__USB2PG" />
            <bitfield caption="CAN1 Module Permission Group bits" mask="0x00003000" name="CAN1PG" values="CFGPG__CAN1PG" />
            <bitfield caption="CAN2 Module Permission Group bits" mask="0x0000C000" name="CAN2PG" values="CFGPG__CAN2PG" />
            <bitfield caption="CAN3 Module Permission Group bits" mask="0x00030000" name="CAN3PG" values="CFGPG__CAN3PG" />
            <bitfield mask="0x000C0000" name="CAN4PG" />
            <bitfield caption="Flash Control Permission Group bits" mask="0x00C00000" name="FCPG" values="CFGPG__FCPG" />
            <bitfield caption="ADC Permission bits" mask="0x03000000" name="ADCPG" values="CFGPG__ADCPG" />
         </register>
         <register caption="EE Data and Op amp Configuration Register" name="CFGCON2" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="EEWS" />
            <bitfield caption="Enable Op amp 1 to PGA Mode bit" mask="0x00010000" name="ENPGA1" values="CFGCON2__ENPGA1" />
            <bitfield caption="Enable Op amp 2 to PGA Mode bit" mask="0x00020000" name="ENPGA2" values="CFGCON2__ENPGA2" />
            <bitfield caption="Enable Op amp 3 to PGA Mode bit" mask="0x00040000" name="ENPGA3" values="CFGCON2__ENPGA3" />
            <bitfield caption="Enable Op amp 5 to PGA Mode bit" mask="0x00100000" name="ENPGA5" values="CFGCON2__ENPGA5" />
         </register>
      </register-group>
      <value-group caption="Silicon Revision" name="DEVID__VER">
         <value caption="Revision A1" name="" value="0x10000000" />
         <value caption="Revision A2" name="" value="0x20000000" />
      </value-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1" />
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
