Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK1024GPE064.atdf
         <register caption="Flash Programming Control Register 2" name="NVMCON2" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Flash Memory Swap Lock Control bits" mask="0x000000C0" name="SWAPLOCK" values="NVMCON2__SWAPLOCK" />
         </register>
      </register-group>
      <value-group caption="NVM Operation bits" name="NVMCON__NVMOP">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Program erase operation: erase all of program Flash memory (all pages must be unprotected" name="" value="0x3" />
         <value caption="Upper program Flash memory erase operation: erases only the upper mapped region of program Flash (all pages in that region must be unprotected)" name="" value="0x6" />
         <value caption="Lower program Flash memory erase operation: erases only the lower mapped region of program Flash (all pages in that region must be unprotected)" name="" value="0x5" />
         <value caption="Page erase operation: erases page selected by NVMADDR" name="" value="0x4" />
         <value caption="Row program operation: programs row selected by NVMADDR" name="" value="0x3" />
         <value caption="Quad Word (128-bit) program operation: programs the 128-bit Flash word selected by NVMADDR" name="" value="0x2" />
         <value caption="Word program operation: programs word selected by NVMADDR" name="" value="0x1" />
         <value caption="No operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Boot Flash Bank Alias Swap Control bit" name="NVMCON__BFSWAP">
         <value caption="Boot Flash Bank 2 is mapped to the lower boot alias and boot Flash Bank 1 is mapped to the upper boot alias" name="" value="0x1" />
         <value caption="Boot Flash Bank 1 is mapped to the lower boot alias and boot Flash Bank 2 is mapped to the upper boot alias" name="" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Bank Swap Control bit" name="NVMCON__PFSWAP">
         <value caption="Program Flash Bank 2 is mapped to the lower mapped region and program Flash Bank 1 is mapped to the upper mapped region" name="" value="0x1" />
         <value caption="Program Flash Bank 1 is mapped to the lower mapped region and program Flash Bank 2 is mapped to the upper mapped region" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Voltage Detect Error bit" name="NVMCON__LVDERR">
         <value caption="Low-voltage detected (possible data corruption" name="" value="0x1" />
         <value caption="Voltage level is acceptable for programming" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Error bit" name="NVMCON__WRERR">
         <value caption="Program or erase sequence did not complete successfully" name="" value="0x1" />
         <value caption="Program or erase sequence completed normally" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable bit" name="NVMCON__WREN">
         <value caption="Enable writes to the WR bit and disables writes to the NVMOP bits" name="" value="0x1" />
         <value caption="Disable writes to WR bit and enables writes to the NVMOP bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Control bit" name="NVMCON__WR">
         <value caption="Initiate a Flash operation" name="" value="0x1" />
         <value caption="Flash operation is complete or inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Memory Page Write-protect Unlock bit" name="NVMPWP__PWPULOCK">
         <value caption="Register is not locked and can be modified" name="" value="0x1" />
         <value caption="Register is locked and cannot be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Page 0 Write-protect bit" name="NVMBWP__UBWP0">
         <value caption="Write protection for physical address 0x01FC20000 through 0x1FC23FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC20000 through 0x1FC23FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Page 1 Write-protect bit" name="NVMBWP__UBWP1">
         <value caption="Write protection for physical address 0x01FC24000 through 0x1FC27FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC24000 through 0x1FC27FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Page 2 Write-protect bit" name="NVMBWP__UBWP2">
         <value caption="Write protection for physical address 0x01FC28000 through 0x1FC2BFFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC28000 through 0x1FC2BFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Page 3 Write-protect bit" name="NVMBWP__UBWP3">
         <value caption="Write protection for physical address 0x01FC2C000 through 0x1FC2FFFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC2C000 through 0x1FC2FFFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Page 4 Write-protect bit" name="NVMBWP__UBWP4">
         <value caption="Write protection for physical address 0x01FC30000 through 0x1FC33FFF enabled" name="" value="0x1" />
         <value caption="Write protection for physical address 0x01FC30000 through 0x1FC33FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Upper Boot Alias Write-protect Unlock bit" name="NVMBWP__UBWPULOCK">
         <value caption="UBWPx bits are not locked and can be modified" name="" value="0x0" />
         <value caption="UBWPx bits are locked and cannot be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 0 Write-protect bit" name="NVMBWP__LBWP0">
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC00000 through 0x1FC03FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 1 Write-protect bit" name="NVMBWP__LBWP1">
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC04000 through 0x1FC07FFF disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Lower Boot Alias Page 2 Write-protect bit" name="NVMBWP__LBWP2">
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF enabled" name="" value="0x0" />
         <value caption="Write protection for physical address 0x01FC08000 through 0x1FC0BFFF disabled" name="" value="0x0" />
      </value-group>
